Tekla.Structures.Model.PointCloud.AutoCreatedBasePointGuid
The definition for auto-created base points guid.

Tekla.Structures.Model.PointCloud.#ctor
Creates a new point cloud instance using the given parameters.

Tekla.Structures.Model.PointCloud.Guid
Gets or sets the guid.

Tekla.Structures.Model.PointCloud.OriginalPath
Gets or sets the point clouds path (where it originally located).

Tekla.Structures.Model.PointCloud.Url
Gets or sets the point clouds URL without a file name.

Tekla.Structures.Model.PointCloud.TcProjectId
Gets or sets the Trimble Connect project id.

Tekla.Structures.Model.PointCloud.TcPointCloudGuid
Gets or sets the Trimble Connect point cloud guid.

Tekla.Structures.Model.PointCloud.Name
Gets or sets the point clouds name. Abbreviated from the point cloud file name. Cannot be given by user.

Tekla.Structures.Model.PointCloud.LocationBy
Gets or sets the location by value: Empty for model origin, base point guid for base point.

Tekla.Structures.Model.PointCloud.UseAutoCreatedBasePoint
Gets or sets a value indicating whether an auto-created base point should be used.
If set to true, LocationBy value is ignored.

Tekla.Structures.Model.PointCloud.BoundingBox
Gets or sets the bounding box.

Tekla.Structures.Model.PointCloud.Scale
Gets or sets the scale.

Tekla.Structures.Model.PointCloud.OffsetX
Gets or sets the offset X.

Tekla.Structures.Model.PointCloud.OffsetY
Gets or sets the offset Y.

Tekla.Structures.Model.PointCloud.OffsetZ
Gets or sets the offset Z.

Tekla.Structures.Model.PointCloud.RotationZ
Gets or sets the rotation Z.

Tekla.Structures.Model.PointCloud.Attach
Attach this point cloud to model. Can select only Potree type point clouds immediately after attach.
Others need to be selected manually after attach has been completed. Use AttachComplete() to find out, if
attach process has completed.
Returns: True if successful, otherwise false.

Tekla.Structures.Model.PointCloud.AttachComplete
Checks if the point cloud attach is complete. Needed when attaching non-Potree point cloud file, which
needs conversion.
Returns: True if successful, otherwise false.

Tekla.Structures.Model.PointCloud.Detach
Detach this point cloud from model.
Returns: True if successful, otherwise false.

Tekla.Structures.Model.PointCloud.Select
Select point cloud by Guid, by Name, by OriginalPath or by Url.
Returns: True if successful, otherwise false.

Tekla.Structures.Model.PointCloud.SetVisibility(System.Collections.Generic.List{Tekla.Structures.Model.UI.View},System.Boolean)
Set point cloud visibility in given views.
views: The views, in which the point clouds visibility is changed.
visible: Visibility value: True for visible, false for hidden.
Returns: True if successful to all given views, otherwise false.

Tekla.Structures.Model.PointCloud.GetVisibleInViews
Gets the views in which this point cloud is visible.
Returns: The available point clouds.

Tekla.Structures.Model.PointCloud.GetPointClouds
Utility function: Gets available point clouds.
Returns: The available point clouds.

Tekla.Structures.Model.PointCloud.ValidateOriginalPath
Validates the OriginalPath member of this class.

Tekla.Structures.Model.PointCloud.GetBoundingBox(Tekla.Structures.ModelInternal.dotPointCloud_t)
Gets the bounding box from values.
pointCloud: The point clouds data
Returns: The bounding box.

Tekla.Structures.Model.PointCloud.GetVisibleViews
Gets the visible views.
Returns: The visible views mapped as view object id to view.

Tekla.Structures.Model.PointCloud.ToStruct
Converts this classes content to struct for TS core interoperability.

Tekla.Structures.Model.PointCloud.Populate(Tekla.Structures.Model.PointCloud)
Populates this class with given data.
pointCloud: The data to be used for population.

Tekla.Structures.Model.PointCloud.Populate(Tekla.Structures.ModelInternal.dotPointCloud_t)
Populates this class with given data.
dotPointCloud: The data to be used for population.